[Killed] LogicalOperator
main/components/HelpRequest/HelpRequestForm.js:105:16
             />
             <Form.Control.Feedback type="invalid">
               {errors.requesterEmail?.message}
-              {errors.requesterEmail?.type === "pattern" &&
-                "Requester email must be in email format <email header>@<domain>."}
+              {errors.requesterEmail?.type === "pattern" || "Requester email must be in email format <email header>@<domain>."}
             </Form.Control.Feedback>
           </Form.Group>
killedBy: HelpRequestForm tests No Error messages on good input
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div class="invalid-feedback">Requester email must be in email format &lt;email header&gt;@&lt;domain&gt;.</div> instead

[Killed] ConditionalExpression
main/components/HelpRequest/HelpRequestForm.js:105:16
             />
             <Form.Control.Feedback type="invalid">
               {errors.requesterEmail?.message}
-              {errors.requesterEmail?.type === "pattern" &&
+              {true &&
                 "Requester email must be in email format <email header>@<domain>."}
             </Form.Control.Feedback>
killedBy: HelpRequestForm tests No Error messages on good input
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div class="invalid-feedback">Requester email must be in email format &lt;email header&gt;@&lt;domain&gt;.</div> instead
