[Killed] BlockStatement
main/pages/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemCreatePage.js:20:52
     },
   });
 
-  const onSuccess = (ucsbDiningCommonsMenuItem) => {
-    toast(
-      `New Menu Item Created - id: ${ucsbDiningCommonsMenuItem.id} name: ${ucsbDiningCommonsMenuItem.name}`,
-    );
-  };
+  const onSuccess = (ucsbDiningCommonsMenuItem) => {};
 
   const mutation = useBackendMutation(
killedBy: UCSBDiningCommonsMenuItemCreatePage tests on submit, makes request to backend, and redirects to /diningcommonsmenuitem
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "New Menu Item Created - id: 3 name: Chicken Caesar Salad"

Number of calls: 0
