[Killed] ArrayDeclaration
main/components/Articles/ArticlesTable.js:32:19
     deleteMutation.mutate(cell);
   };
 
-  const columns = [
-    {
-      Header: "ID",
-      accessor: "id",
-    },
-    {
-      Header: "Title",
-      accessor: "title",
-    },
-    {
-      Header: "URL",
-      accessor: "url",
-    },
-    {
-      Header: "Explanation",
-      accessor: "explanation",
-    },
-    {
-      Header: "Date Added",
-      accessor: "dateAdded",
-    },
-  ];
+  const columns = [];
 
   if (hasRole(currentUser, "ROLE_ADMIN")) {
killedBy: ArticlesTable tests Has the expected column headers and content for ordinary user
statusReason: TestingLibraryElementError: Unable to find an element with the text: ID. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] BlockStatement
main/components/Articles/ArticlesTable.js:55:43
     },
   ];
 
-  if (hasRole(currentUser, "ROLE_ADMIN")) {
-    columns.push(
-      ButtonColumn("Edit", "primary", editCallback, "ArticlesTable")
-    );
-    columns.push(
-      ButtonColumn("Delete", "danger", deleteCallback, "ArticlesTable")
-    );
-  }
+  if (hasRole(currentUser, "ROLE_ADMIN")) {}
 
   return <OurTable data={articles} columns={columns} testid={"ArticlesTable"} />;
killedBy: ArticlesTable tests Has the expected column headers and content for adminUser
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="ArticlesTable-cell-row-0-col-Edit-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] StringLiteral
main/components/Articles/ArticlesTable.js:60:20
       ButtonColumn("Edit", "primary", editCallback, "ArticlesTable")
     );
     columns.push(
-      ButtonColumn("Delete", "danger", deleteCallback, "ArticlesTable")
+      ButtonColumn("", "danger", deleteCallback, "ArticlesTable")
     );
   }
killedBy: ArticlesTable tests Has the expected column headers and content for adminUser
statusReason: Error: A column ID (or string accessor) is required!
