[Killed] ObjectLiteral
main/components/UCSBOrganization/UCSBOrganizationTable.js:50:5
       Header: "OrgTranslation",
       accessor: "orgTranslation",
     },
-    {
-      Header: "Inactive",
-      accessor: "inactive",
-      Cell: ({ value }) => (value ? "✓" : "✕"),
-    },
+    {},
   ];
 
killedBy: UCSBOrganizationTable tests renders empty table correctly
statusReason: Error: A column ID (or string accessor) is required!

[Killed] ArrowFunction
main/components/UCSBOrganization/UCSBOrganizationTable.js:53:13
     {
       Header: "Inactive",
       accessor: "inactive",
-      Cell: ({ value }) => (value ? "✓" : "✕"),
+      Cell: () => undefined,
     },
   ];
killedBy: UCSBOrganizationTable tests Has the expected column headers, content and buttons for admin user
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  ✕
Received:

[Killed] StringLiteral
main/components/UCSBOrganization/UCSBOrganizationTable.js:53:37
     {
       Header: "Inactive",
       accessor: "inactive",
-      Cell: ({ value }) => (value ? "✓" : "✕"),
+      Cell: ({ value }) => (value ? "" : "✕"),
     },
   ];
killedBy: UCSBOrganizationTable tests Has the expected column headers, content and buttons for admin user
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  ✓
Received:

[Killed] ConditionalExpression
main/components/UCSBOrganization/UCSBOrganizationTable.js:63:7
   //       ButtonColumn("Delete", "danger", deleteCallback, testIdPrefix),
   //     );
   //   }
-  if (hasRole(currentUser, "ROLE_ADMIN")) {
+  if (true) {
     columns.push(ButtonColumn("Edit", "primary", editCallback, testIdPrefix));
     columns.push(
killedBy: UCSBOrganizationIndexPage tests renders three ucsborganization correctly for regular user
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <button class="btn btn-danger" data-testid="UCSBOrganizationTable-cell-row-0-col-Delete-button" type="button">Delete</button> instead

[Killed] ConditionalExpression
main/components/UCSBOrganization/UCSBOrganizationTable.js:63:7
   //       ButtonColumn("Delete", "danger", deleteCallback, testIdPrefix),
   //     );
   //   }
-  if (hasRole(currentUser, "ROLE_ADMIN")) {
+  if (false) {
     columns.push(ButtonColumn("Edit", "primary", editCallback, testIdPrefix));
     columns.push(
killedBy: UCSBOrganizationIndexPage tests what happens when you click delete, admin
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="UCSBOrganizationTable-cell-row-0-col-Delete-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
