[Killed] ObjectLiteral
main/components/HelpRequest/HelpRequestForm.js:160:43
               id="explanation"
               type="text"
               isInvalid={Boolean(errors.explanation)}
-              {...register("explanation", {
-                required: "Explanation of request is required.",
-              })}
+              {...register("explanation", {})}
             />
             <Form.Control.Feedback type="invalid">
killedBy: HelpRequestForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Explanation of request is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >
