[Killed] ObjectLiteral
main/components/HelpRequest/HelpRequestTable.js:61:5
       Header: "Table or Breakout Room Number",
       accessor: "tableOrBreakoutRoom",
     },
-    {
-      Header: "Request Time",
-      accessor: "requestTime",
-    },
+    {},
     {
       Header: "Explanation",
killedBy: UserTable tests Checkmark / X for Handled column shows up as expected
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/HelpRequest/HelpRequestTable.js:62:15
       accessor: "tableOrBreakoutRoom",
     },
     {
-      Header: "Request Time",
+      Header: "",
       accessor: "requestTime",
     },
killedBy: UserTable tests Has the expected column headers and content for ordinary user
statusReason: TestingLibraryElementError: Unable to find an element with the text: Request Time. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] ObjectLiteral
main/components/HelpRequest/HelpRequestTable.js:69:5
       Header: "Explanation",
       accessor: "explanation",
     },
-    {
-      Header: "Handled",
-      accessor: "solved",
-      // Credits to Jayden for the code here!
-      // Renders a checkmark box for whether or not the help request has been solved.
-      Cell: ({ value }) => (value ? "✅" : "❌"),
-    },
+    {},
   ];
 
killedBy: UserTable tests Checkmark / X for Handled column shows up as expected
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/HelpRequest/HelpRequestTable.js:74:43
       accessor: "solved",
       // Credits to Jayden for the code here!
       // Renders a checkmark box for whether or not the help request has been solved.
-      Cell: ({ value }) => (value ? "✅" : "❌"),
+      Cell: ({ value }) => (value ? "✅" : ""),
     },
   ];
killedBy: UserTable tests Checkmark / X for Handled column shows up as expected
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  ❌
Received:


Ignored nodes: comments, script, style
