[Killed] ConditionalExpression
main/components/HelpRequest/HelpRequestForm.js:81:16
               })}
             />
             <Form.Control.Feedback type="invalid">
-              {errors.requestTime && "Request time is required."}
+              {false}
             </Form.Control.Feedback>
           </Form.Group>
killedBy: HelpRequestForm tests Correct Error messsages on missing input
statusReason: Error: Unable to find an element with the text: /Request time is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ConditionalExpression
main/components/HelpRequest/HelpRequestForm.js:81:16
               })}
             />
             <Form.Control.Feedback type="invalid">
-              {errors.requestTime && "Request time is required."}
+              {true}
             </Form.Control.Feedback>
           </Form.Group>
killedBy: HelpRequestForm tests Correct Error messsages on missing input
statusReason: Error: Unable to find an element with the text: /Request time is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ObjectLiteral
main/components/HelpRequest/HelpRequestForm.js:96:46
               id="requesterEmail"
               type="text"
               isInvalid={Boolean(errors.requesterEmail)}
-              {...register("requesterEmail", {
-                required: "Requester email is required.",
-                pattern: email_regex,
-              })}
+              {...register("requesterEmail", {})}
             />
             <Form.Control.Feedback type="invalid">
killedBy: HelpRequestForm tests Correct Error messages on bad input
statusReason: Error: Unable to find an element with the text: /Requester email must be in email format <email header>@<domain>./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] OptionalChaining
main/components/HelpRequest/HelpRequestForm.js:103:16
             />
             <Form.Control.Feedback type="invalid">
               {errors.requesterEmail?.message}
-              {errors.requesterEmail?.type === "pattern" &&
+              {errors.requesterEmail.type === "pattern" &&
                 "Requester email must be in email format <email header>@<domain>."}
             </Form.Control.Feedback>
killedBy: HelpRequestForm tests renders correctly
statusReason: TypeError: Cannot read properties of undefined (reading 'type')

[Killed] ConditionalExpression
main/components/HelpRequest/HelpRequestForm.js:103:16
             />
             <Form.Control.Feedback type="invalid">
               {errors.requesterEmail?.message}
-              {errors.requesterEmail?.type === "pattern" &&
-                "Requester email must be in email format <email header>@<domain>."}
+              {false}
             </Form.Control.Feedback>
           </Form.Group>
killedBy: HelpRequestForm tests Correct Error messages on bad input
statusReason: Error: Unable to find an element with the text: /Requester email must be in email format <email header>@<domain>./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] StringLiteral
main/components/HelpRequest/HelpRequestForm.js:160:27
               type="text"
               isInvalid={Boolean(errors.explanation)}
               {...register("explanation", {
-                required: "Explanation of request is required.",
+                required: "",
               })}
             />
killedBy: HelpRequestForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Explanation of request is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >
