[Killed] ObjectLiteral
main/components/HelpRequest/HelpRequestTable.js:46:5
         explanation
         solved
     */
-    {
-      Header: "id",
-      accessor: "id", // accessor is the "key" in the data
-    },
+    {},
     {
       Header: "Requester Email",
killedBy: UserTable tests Checkmark / X for Handled column shows up as expected
statusReason: Error: A column ID (or string accessor) is required!

[Killed] ObjectLiteral
main/components/HelpRequest/HelpRequestTable.js:58:5
       Header: "Team ID",
       accessor: "teamId",
     },
-    {
-      Header: "Table or Breakout Room Number",
-      accessor: "tableOrBreakoutRoom",
-    },
+    {},
     {
       Header: "Request Time",
killedBy: UserTable tests Checkmark / X for Handled column shows up as expected
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/HelpRequest/HelpRequestTable.js:59:15
       accessor: "teamId",
     },
     {
-      Header: "Table or Breakout Room Number",
+      Header: "",
       accessor: "tableOrBreakoutRoom",
     },
killedBy: UserTable tests Has the expected column headers and content for ordinary user
statusReason: TestingLibraryElementError: Unable to find an element with the text: Table or Breakout Room Number. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      ro

[Killed] ArrowFunction
main/components/HelpRequest/HelpRequestTable.js:75:15
         accessor: "solved",
         // Credits to Jayden for the code here! 
         // Renders a checkmark box for whether or not the help request has been solved.
-        Cell: ({ value }) => (value ? "✅" : "❌"),
+        Cell: () => undefined,
     },
   ];
killedBy: UserTable tests Checkmark / X for Handled column shows up as expected
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  ✅
Received:


Ignored nodes: comments, script, style

[Killed] StringLiteral
main/components/HelpRequest/HelpRequestTable.js:88:62
     );
   }
 
-  return <OurTable data={requests} columns={columns} testid={"HelpRequestTable"} />;
+  return <OurTable data={requests} columns={columns} testid={""} />;
 }
 
killedBy: UserTable tests Checkmark / X for Handled column shows up as expected
statusReason: Error: Unable to find an element by: [data-testid="HelpRequestTable-cell-row-0-col-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
