[Killed] OptionalChaining
main/components/RecommendationRequest/RecommendationRequestForm.js:70:16
             />
             <Form.Control.Feedback type="invalid">
               {errors.requesterEmail && "requesterEmail is required."}
-              {errors.requesterEmail?.type === "pattern" &&
+              {errors.requesterEmail.type === "pattern" &&
                 "requesterEmail must be in the format <username>@<domain>.<com>"}
             </Form.Control.Feedback>
killedBy: RecommendationRequestForm tests renders correctly
statusReason: TypeError: Cannot read properties of undefined (reading 'type')

[Killed] ConditionalExpression
main/components/RecommendationRequest/RecommendationRequestForm.js:70:16
             />
             <Form.Control.Feedback type="invalid">
               {errors.requesterEmail && "requesterEmail is required."}
-              {errors.requesterEmail?.type === "pattern" &&
+              {true &&
                 "requesterEmail must be in the format <username>@<domain>.<com>"}
             </Form.Control.Feedback>
killedBy: RecommendationRequestForm tests Correct Error messsages on missing input
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div class="invalid-feedback">requesterEmail is required.requesterEmail must be in the format &lt;username&gt;@&lt;domain&gt;.&lt;com&gt;</div> instead

[Timeout] StringLiteral
main/components/RecommendationRequest/RecommendationRequestForm.js:71:17
             <Form.Control.Feedback type="invalid">
               {errors.requesterEmail && "requesterEmail is required."}
               {errors.requesterEmail?.type === "pattern" &&
-                "requesterEmail must be in the format <username>@<domain>.<com>"}
+                ""}
             </Form.Control.Feedback>
           </Form.Group>

[Killed] ConditionalExpression
main/components/RecommendationRequest/RecommendationRequestForm.js:89:16
               })}
             />
             <Form.Control.Feedback type="invalid">
-              {errors.professorEmail && "professorEmail is required."}
+              {true}
               {errors.professorEmail?.type === "pattern" &&
                 "professorEmail must be in the format <username>@<domain>.<com>"}
killedBy: RecommendationRequestForm tests Correct Error messsages on bad input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /professorEmail is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] LogicalOperator
main/components/RecommendationRequest/RecommendationRequestForm.js:90:16
             />
             <Form.Control.Feedback type="invalid">
               {errors.professorEmail && "professorEmail is required."}
-              {errors.professorEmail?.type === "pattern" &&
-                "professorEmail must be in the format <username>@<domain>.<com>"}
+              {errors.professorEmail?.type === "pattern" || "professorEmail must be in the format <username>@<domain>.<com>"}
             </Form.Control.Feedback>
           </Form.Group>
killedBy: RecommendationRequestForm tests Correct Error messsages on bad input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /professorEmail must be in the format <username>@<domain>.<com>/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ConditionalExpression
main/components/RecommendationRequest/RecommendationRequestForm.js:90:16
             />
             <Form.Control.Feedback type="invalid">
               {errors.professorEmail && "professorEmail is required."}
-              {errors.professorEmail?.type === "pattern" &&
-                "professorEmail must be in the format <username>@<domain>.<com>"}
+              {false}
             </Form.Control.Feedback>
           </Form.Group>
killedBy: RecommendationRequestForm tests Correct Error messsages on bad input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /professorEmail must be in the format <username>@<domain>.<com>/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] StringLiteral
main/components/RecommendationRequest/RecommendationRequestForm.js:91:17
             <Form.Control.Feedback type="invalid">
               {errors.professorEmail && "professorEmail is required."}
               {errors.professorEmail?.type === "pattern" &&
-                "professorEmail must be in the format <username>@<domain>.<com>"}
+                ""}
             </Form.Control.Feedback>
           </Form.Group>
killedBy: RecommendationRequestForm tests Correct Error messsages on bad input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /professorEmail must be in the format <username>@<domain>.<com>/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ObjectLiteral
main/components/RecommendationRequest/RecommendationRequestForm.js:123:45
               id="dateRequested"
               type="datetime-local"
               isInvalid={Boolean(errors.dateRequested)}
-              {...register("dateRequested", {
-                required: "Local date time in ISO format required.",
-                pattern: isodate_regex,
-              })}
+              {...register("dateRequested", {})}
             />
             <Form.Control.Feedback type="invalid">
killedBy: RecommendationRequestForm tests Correct Error messsages on missing input
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 1

[Killed] StringLiteral
main/components/RecommendationRequest/RecommendationRequestForm.js:124:27
               type="datetime-local"
               isInvalid={Boolean(errors.dateRequested)}
               {...register("dateRequested", {
-                required: "Local date time in ISO format required.",
+                required: "",
                 pattern: isodate_regex,
               })}
killedBy: RecommendationRequestForm tests Correct Error messsages on missing input
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 1
