[Killed] BlockStatement
main/components/RecommendationRequest/RecommendationRequestTable.js:19:34
 }) {
   const navigate = useNavigate();
 
-  const editCallback = (cell) => {
-    navigate(`/recommendationRequest/edit/${cell.row.values.id}`);
-  };
+  const editCallback = (cell) => {};
 
   // Stryker disable all : hard to test for query caching
killedBy: RecommendationRequestTable tests Edit button navigates to the edit page
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/recommendationRequest/edit/1"

Number of calls: 0

Ignored nodes: comments, script, style
<html>

[Killed] ArrowFunction
main/components/RecommendationRequest/RecommendationRequestTable.js:64:13
       Header: "Finished",
       accessor: "done",
       // Adding a custom cell renderer
-      Cell: ({ value }) => (value ? "✓" : "✕"), // Use Unicode symbols for checkmark and cross
+      Cell: () => undefined, // Use Unicode symbols for checkmark and cross
     },
     {
killedBy: RecommendationRequestTable tests Has the expected column headers, content and buttons for admin user
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  ✕
Received:

[Killed] BlockStatement
main/components/RecommendationRequest/RecommendationRequestTable.js:76:43
     },
   ];
 
-  if (hasRole(currentUser, "ROLE_ADMIN")) {
-    columns.push(
-      ButtonColumn(
-        "Edit",
-        "primary",
-        editCallback,
-        "recommendationRequestTable",
-      ),
-    );
-    columns.push(
-      ButtonColumn(
-        "Delete",
-        "danger",
-        deleteCallback,
-        "recommendationRequestTable",
-      ),
-    );
-  }
+  if (hasRole(currentUser, "ROLE_ADMIN")) {}
 
   return <OurTable data={requests} columns={columns} testid={testIdPrefix} />;
killedBy: RecommendationRequestTable tests Has the expected column headers, content and buttons for admin user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="recommendationRequestTable-cell-row-0-col-Edit-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
