[Killed] StringLiteral
main/components/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemForm.js:46:23
           type="text"
           isInvalid={Boolean(errors.diningcommonscode)}
           {...register("diningcommonscode", {
-            required: "DiningCommonsCode is required.",
+            required: "",
             maxLength: {
               value: 30,
killedBy: UCSBDiningCommonsMenuItemForm tests that the correct validations are performed
statusReason: Error: Unable to find an element with the text: /DiningCommonsCode is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >
